app/controllers/movies_controller.rb

  def index

    if params[:clear]
      reset_session
    end


    #check the params here for the session requirements
    @all_ratings = Movie.ratings
    redirect = false
    redirection = Hash.new
    if params[:ratings]
      @checked_ratings = params[:ratings].keys
      @movies = Movie.find_all_by_rating @checked_ratings
      session[:ratings] = params[:ratings]
    elsif  session[:ratings]
      redirect = true
      redirection[:ratings] = session[:ratings]
      #redirect_to movies_path(:ratings => session[:ratings])
    else
      @movies = Movie.all
    end

    ## still need to figure out how to double-filter results in case
    ## both ratings and order is selected
    if params[:order] == 'title'
      @movies = Movie.find(:all, :order =>'title')
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G') ORDER BY release_date
SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G') AND "movies"."order" = 'title'